---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.BendFailures.DeleteSegmentInBankNotAllowed
source: html/b611bda8-9f59-63a0-eeb9-8c1e5a9849ef.htm
---
# Autodesk.Revit.DB.BuiltInFailures.BendFailures.DeleteSegmentInBankNotAllowed Property

Delete a segment in a bank is not allowed

## Syntax (C#)
```csharp
public static FailureDefinitionId DeleteSegmentInBankNotAllowed { get; }
```